Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAreaAttributes.AreaSupportTypeEnum Enumeration
 The new area support options.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AreaSupportTypeEnum
Public Enumeration AreaSupportTypeEnum
Members
Member name | Value | Description
AREA_SUPPORT_NO | 0 |  The "no" area support option.
AREA_SUPPORT_SIMPLE | 1 |  The area support simple.
AREA_SUPPORT_FULL | 2 |  The area support full.
See Also
Reference
Tekla.Structures.Analysis Namespace